## Staging: load_balancer
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 4 to add, 1 to change, 4 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                       NAME                       |
|----------|--------------------------------------------------|
| recreate | `aws_lb.ai_answers`                              |
|          | `aws_lb_listener.ai_answers_listener`            |
|          | `aws_lb_target_group.ai_answers`                 |
|          | `aws_security_group.ai_answers_load_balancer_sg` |
| update   | `aws_route53_record.ai_answers`                  |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lb.ai_answers must be replaced
-/+ resource "aws_lb" "ai_answers" {
      ~ arn                                                          = "arn:aws:elasticloadbalancing:ca-central-1:992382783569:loadbalancer/app/ai-answers-lb/054264388446064f" -> (known after apply)
      ~ arn_suffix                                                   = "app/ai-answers-lb/054264388446064f" -> (known after apply)
      ~ dns_name                                                     = "ai-answers-lb-1206359941.ca-central-1.elb.amazonaws.com" -> (known after apply)
      - enable_cross_zone_load_balancing                             = true -> null
      - enable_zonal_shift                                           = false -> null
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      ~ id                                                           = "arn:aws:elasticloadbalancing:ca-central-1:992382783569:loadbalancer/app/ai-answers-lb/054264388446064f" -> (known after apply)
      ~ ip_address_type                                              = "ipv4" -> (known after apply)
      ~ name                                                         = "ai-answers-lb" -> "ai-answers-staging-lb" # forces replacement
      + name_prefix                                                  = (known after apply)
      ~ security_groups                                              = [
          - "sg-08e35f1019824d56a",
        ] -> (known after apply)
        tags                                                         = {
            "CostCentre" = "ai-answers-staging"
        }
      ~ vpc_id                                                       = "vpc-0659c9b2d7046368f" -> (known after apply)
      ~ zone_id                                                      = "ZQSVJUPU6J1EY" -> (known after apply)
        # (16 unchanged attributes hidden)

      - access_logs {
          - enabled = false -> null
            # (2 unchanged attributes hidden)
        }

      - connection_logs {
          - enabled = false -> null
            # (2 unchanged attributes hidden)
        }

      ~ subnet_mapping (known after apply)
      - subnet_mapping {
          - subnet_id            = "subnet-0bf150cb1ad932800" -> null
            # (4 unchanged attributes hidden)
        }
      - subnet_mapping {
          - subnet_id            = "subnet-0d3c0e10e6fd0e4bf" -> null
            # (4 unchanged attributes hidden)
        }
    }

  # aws_lb_listener.ai_answers_listener must be replaced
-/+ resource "aws_lb_listener" "ai_answers_listener" {
      ~ arn                                                                   = "arn:aws:elasticloadbalancing:ca-central-1:992382783569:listener/app/ai-answers-lb/054264388446064f/9f4e1b4b69a68aad" -> (known after apply)
      ~ id                                                                    = "arn:aws:elasticloadbalancing:ca-central-1:992382783569:listener/app/ai-answers-lb/054264388446064f/9f4e1b4b69a68aad" -> (known after apply)
      ~ load_balancer_arn                                                     = "arn:aws:elasticloadbalancing:ca-central-1:992382783569:loadbalancer/app/ai-answers-lb/054264388446064f" -> (known after apply) # forces replacement
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      ~ routing_http_response_server_enabled                                  = false -> (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      - tags                                                                  = {} -> null
      + tcp_idle_timeout_seconds                                              = (known after apply)
        # (5 unchanged attributes hidden)

      ~ default_action {
          ~ order            = 1 -> (known after apply)
          ~ target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:992382783569:targetgroup/ai-answers/2ad377cc9d36fc44" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ mutual_authentication (known after apply)
      - mutual_authentication {
          - ignore_client_certificate_expiry = false -> null
          - mode                             = "off" -> null
            # (2 unchanged attributes hidden)
        }
    }

  # aws_lb_target_group.ai_answers must be replaced
-/+ resource "aws_lb_target_group" "ai_answers" {
      ~ arn                                = "arn:aws:elasticloadbalancing:ca-central-1:992382783569:targetgroup/ai-answers/2ad377cc9d36fc44" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/ai-answers/2ad377cc9d36fc44" -> (known after apply)
      + connection_termination             = (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:ca-central-1:992382783569:targetgroup/ai-answers/2ad377cc9d36fc44" -> (known after apply)
      ~ ip_address_type                    = "ipv4" -> (known after apply)
      ~ load_balancer_arns                 = [
          - "arn:aws:elasticloadbalancing:ca-central-1:992382783569:loadbalancer/app/ai-answers-lb/054264388446064f",
        ] -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
      ~ load_balancing_anomaly_mitigation  = "off" -> (known after apply)
      ~ load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> (known after apply)
      ~ name                               = "ai-answers" -> "ai-answers-staging" # forces replacement
      + name_prefix                        = (known after apply)
      + preserve_client_ip                 = (known after apply)
        tags                               = {
            "CostCentre" = "ai-answers-staging"
        }
        # (10 unchanged attributes hidden)

      ~ health_check {
          ~ matcher             = "200" -> (known after apply)
            # (8 unchanged attributes hidden)
        }

      ~ stickiness (known after apply)
      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
            # (1 unchanged attribute hidden)
        }

      ~ target_failover (known after apply)
      - target_failover {}

      ~ target_group_health (known after apply)
      - target_group_health {
          - dns_failover {
              - minimum_healthy_targets_count      = "1" -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
          - unhealthy_state_routing {
              - minimum_healthy_targets_count      = 1 -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
        }

      ~ target_health_state (known after apply)
      - target_health_state {}
    }

  # aws_route53_record.ai_answers will be updated in-place
  ~ resource "aws_route53_record" "ai_answers" {
        id                               = "Z0155535SR6XQTKZDGDA_ai-answers.cdssandbox.xyz_A"
        name                             = "ai-answers.cdssandbox.xyz"
        # (8 unchanged attributes hidden)

      ~ alias {
          ~ name                   = "ai-answers-lb-1206359941.ca-central-1.elb.amazonaws.com" -> (known after apply)
          ~ zone_id                = "ZQSVJUPU6J1EY" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # aws_security_group.ai_answers_load_balancer_sg must be replaced
-/+ resource "aws_security_group" "ai_answers_load_balancer_sg" {
      ~ arn                    = "arn:aws:ec2:ca-central-1:992382783569:security-group/sg-08e35f1019824d56a" -> (known after apply)
      ~ description            = "Security group for load balancer" -> "Security group for ai-answers staging load balancer" # forces replacement
      ~ id                     = "sg-08e35f1019824d56a" -> (known after apply)
      ~ name                   = "ai_answers_load_balancer_sg" -> "ai-answers-staging-load-balancer-sg" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "992382783569" -> (known after apply)
        tags                   = {
            "CostCentre" = "ai-answers-staging"
        }
        # (5 unchanged attributes hidden)
    }

Plan: 4 to add, 1 to change, 4 to destroy.

Changes to Outputs:
  ~ ai_answers_load_balancer_sg = "sg-08e35f1019824d56a" -> (known after apply)
  ~ lb_listener                 = {
      ~ arn                                                                   = "arn:aws:elasticloadbalancing:ca-central-1:992382783569:listener/app/ai-answers-lb/054264388446064f/9f4e1b4b69a68aad" -> (known after apply)
      ~ default_action                                                        = [
          ~ {
              ~ order                = 1 -> (known after apply)
              ~ target_group_arn     = "arn:aws:elasticloadbalancing:ca-central-1:992382783569:targetgroup/ai-answers/2ad377cc9d36fc44" -> (known after apply)
                # (6 unchanged attributes hidden)
            },
        ]
      ~ id                                                                    = "arn:aws:elasticloadbalancing:ca-central-1:992382783569:listener/app/ai-answers-lb/054264388446064f/9f4e1b4b69a68aad" -> (known after apply)
      ~ load_balancer_arn                                                     = "arn:aws:elasticloadbalancing:ca-central-1:992382783569:loadbalancer/app/ai-answers-lb/054264388446064f" -> (known after apply)
      ~ mutual_authentication                                                 = [
          - {
              - advertise_trust_store_ca_names   = ""
              - ignore_client_certificate_expiry = false
              - mode                             = "off"
              - trust_store_arn                  = ""
            },
        ] -> (known after apply)
      ~ routing_http_request_x_amzn_mtls_clientcert_header_name               = "" -> (known after apply)
      ~ routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = "" -> (known after apply)
      ~ routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = "" -> (known after apply)
      ~ routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = "" -> (known after apply)
      ~ routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = "" -> (known after apply)
      ~ routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = "" -> (known after apply)
      ~ routing_http_request_x_amzn_tls_cipher_suite_header_name              = "" -> (known after apply)
      ~ routing_http_request_x_amzn_tls_version_header_name                   = "" -> (known after apply)
      ~ routing_http_response_access_control_allow_credentials_header_value   = "" -> (known after apply)
      ~ routing_http_response_access_control_allow_headers_header_value       = "" -> (known after apply)
      ~ routing_http_response_access_control_allow_methods_header_value       = "" -> (known after apply)
      ~ routing_http_response_access_control_allow_origin_header_value        = "" -> (known after apply)
      ~ routing_http_response_access_control_expose_headers_header_value      = "" -> (known after apply)
      ~ routing_http_response_access_control_max_age_header_value             = "" -> (known after apply)
      ~ routing_http_response_content_security_policy_header_value            = "" -> (known after apply)
      ~ routing_http_response_server_enabled                                  = false -> (known after apply)
      ~ routing_http_response_strict_transport_security_header_value          = "" -> (known after apply)
      ~ routing_http_response_x_content_type_options_header_value             = "" -> (known after apply)
      ~ routing_http_response_x_frame_options_header_value                    = "" -> (known after apply)
      ~ tags                                                                  = {} -> null
      + tcp_idle_timeout_seconds                                              = (known after apply)
        # (7 unchanged attributes hidden)
    }
  ~ lb_target_group_arn         = "arn:aws:elasticloadbalancing:ca-central-1:992382783569:targetgroup/ai-answers/2ad377cc9d36fc44" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.ai_answers"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb.ai_answers"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_listener.ai_answers_listener"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_target_group.ai_answers"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.ai_answers_load_balancer_sg"]

24 tests, 19 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
